{
  "backend/main.mo": "Motoko backend managing applications, user profiles, access control, Stripe config, and a publish/unpublish site state.",
  "feature_evidence.json": "Feature evidence report documenting removal of a specific FAQ item and listing affected files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing each frontend file’s purpose and recent updates.",
  "frontend/index.css": "Empty stylesheet placeholder for project-level CSS.",
  "frontend/index.html": "HTML entry point defining metadata, SEO tags, and mounting the React application.",
  "frontend/IONOS_CUSTOM_DOMAIN_SETUP.md": "Guide explaining how to configure a custom IONOS domain to point to the deployed Internet Computer canister.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with the SitePublishGate.",
  "frontend/src/components/HomeFaqPreview.tsx": "Home page FAQ preview card displaying a small accordion with key competition questions.",
  "frontend/src/components/Layout.tsx": "Page layout component providing header, footer, and outlet for routed content.",
  "frontend/src/components/SiteFooter.tsx": "Footer with competition info, navigation links, mission statement, and branding credit.",
  "frontend/src/components/SiteHeader.tsx": "Responsive navigation header showing branding and active-state links for Home, Apply, and FAQs.",
  "frontend/src/components/SitePublishGate.tsx": "Gates rendering based on site publish status, showing loading, error, offline, or children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates related queries on change.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Provides a mutation to create a Stripe checkout session via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading identities, logging in/out, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Contains queries and mutations for Stripe config check and submitting finalized applications.",
  "frontend/src/hooks/useSitePublished.ts": "Checks whether the site is published using the backend actor with retry logic.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, fonts, and background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ApplyPage.tsx": "Displays a card with a link to an external application form for applicants.",
  "frontend/src/pages/FaqsPage.tsx": "Renders FAQ sections using accordion components for competition-related questions.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, timeline, call‑to‑action, and feature highlights for the music competition.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message, explains no charges occurred, and offers navigation to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe session status, finalizes an application draft, and shows success or error states accordingly.",
  "frontend/src/pages/SiteOfflinePage.tsx": "Simple maintenance page indicating the site is temporarily offline.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and sessionStorage values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, fonts, colors, animations, and plugins.",
  "project_state.json": "Project metadata tracking state, issues, and feature requests including custom domain setup and FAQ removal."
}