{
  "backend/main.mo": "Backend actor managing applications, user profiles, Stripe config, and access control with submission and admin-only queries.",
  "feature_evidence.json": "Feature mapping file listing implemented features, related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style text containing short descriptive summaries for all frontend files.",
  "frontend/index.css": "Empty placeholder stylesheet.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, apply, FAQs, and payment result pages.",
  "frontend/src/components/Layout.tsx": "Page wrapper rendering header, footer, and route content via Outlet.",
  "frontend/src/components/SiteFooter.tsx": "Footer with competition info, navigation links, mission message, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with logo and responsive navigation highlighting the active route.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching authenticated or anonymous backend actors with access control initialization.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook creating Stripe checkout sessions through the backend and validating returned session data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and status tracking. Wraps AuthClient creation with custom options and exposes identity state to consumers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for checking Stripe configuration and finalizing applications. Submits completed applications using the authenticated actor and invalidates relevant queries.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines a color palette with light and dark themes. Applies global background styling, fonts, and layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting App within React Query and Internet Identity providers. Loads global CSS and initializes QueryClient.",
  "frontend/src/pages/ApplyPage.tsx": "Implements the application form with authentication checks, form validation, video upload or YouTube link handling, and Stripe checkout initiation. Stores a draft in sessionStorage before redirecting to payment.",
  "frontend/src/pages/FaqsPage.tsx": "Renders an FAQ section with accordion components covering competition details. Uses styled cards and typography to present information.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero and feature sections promoting the music competition. Provides navigation to the application page and highlights event features.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation message with guidance and options to retry or return home. Informs the user that their application draft was preserved.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe payment confirmation, finalizes the stored application draft, and displays processing, success, or error states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom typography, colors, shadows, animations, and plugins for the project's design system.",
  "project_state.json": "Stores project metadata, feature descriptions, requirements, and asset needs for the music competition website."
}