{
  "backend/main.mo": "Canister implements application submission, user profiles, Stripe config, access control, and admin-only queries using storage and authorization mixins.",
  "feature_evidence.json": "Feature report documenting updates required for the FAQs page with submission instructions and 2026 competition timeline.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing styling, pages, hooks, and behavior.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point setting the document title and loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages using a shared layout.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing header, footer, and main outlet structure.",
  "frontend/src/components/SiteFooter.tsx": "Footer with competition details, quick links, mission text, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive navigation header displaying competition branding and active route highlighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing access control and refetching dependent queries.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation creating Stripe checkout sessions and validating returned session URLs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hooks handling login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to check Stripe configuration and finalize applications by building and submitting an Application object.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and global background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/ApplyPage.tsx": "Renders an application page with a card and button linking to an external JotForm application form.",
  "frontend/src/pages/FaqsPage.tsx": "Displays a FAQ section using accordion components inside a styled card layout.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section and feature cards promoting the music competition.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation notice with explanations and navigation options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post‑payment logic by verifying Stripe status, submitting the application draft, and showing success or error states.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters, syncing them to sessionStorage, and clearing stored or hash-based values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, requirements, known issues, and architectural notes for the music competition website."
}